adapta-gtk-theme
alacritty
alsa-utils
android-apktool
android-file-transfer
android-tools
anki
arandr
arch-install-scripts
arp-scan
atool # unarchive tool
bat # better cat
bc
bibata-cursor-theme
bind
brave-bin
breeze-gtk
burpsuite
calc
cantarell-fonts
catimg
chafa # used for lf image preview
clang
cloc
ctags
dash
desktop-file-utils # Usually required by many things
dhclient
dialog
diff-so-fancy # better looking terminal diffs
discord
dmenu
docker
docker-compose
dosfstools # mkfs.fat
dotnet-runtime
dotnet-sdk
dunst
etcher-bin
ethtool # required for TLP to disable WOL
expac # requried by paccy
exploitdb
fcitx-configtool
fcitx-mozc
fcitx-qt5
fd # find directories and files
ffmpeg
fish
flameshot
fontpreview-git
freetube-bin
fzf
gcolor3 # color picker
genymotion
gnome-keyring
go-tools # goimports, godoc, gopls, etc
graphviz
highlight # used for lf preview
htop
hugo
imv
inetutils
intellij-idea-community-edition
inter-font
jdk8-openjdk
jdk-openjdk
jp2a # convert image to ascii
jq # Json parser
junit
kitty
kvantum-qt5
lazygit
lf
libnatpmp
libnotify # library for sending desktop notifications
libva-utils # used to verify VA-API
linux-firmware # Required for hardware video acceleration for skylake or later generations
lxappearance # Used to customize GTK theme
maim # sceenshot utility
man-db
masscan
mediainfo # used for lf preview
megasync
mlocate # Locate
mono
mpv
ncdu # better du (find what is taking up space)
ncurses # C formatting for VSCode
neofetch
neovim
network-manager-applet
newsboat
nmap
noto-fonts
noto-fonts-cjk
noto-fonts-emoji # Google emojis
ntfs-3g
obsidian-appimage
openresolv
openssh
openssh-askpass
overdue
p7zip # 7z extentions
pacman-contrib # checkupdates, pactree and stuff
pacutils
papirus-icon-theme
parsec-bin
pavucontrol
pcmanfm-gtk3
perl-image-exiftool
pkgfile # tool for searching files from packages
prettier
python
python-pip
qbittorrent
redshift # nightlight
reflector
ripgrep
routersploit
shellcheck
shfmt # shell format
slack-desktop
speedtest-cli
stow
sxhkd # Universal keybindings
sxiv # image viewer
tldr
tlp # power management
tor-browser
traceroute
trash-cli
tree
ttf-cascadia-code # programming font
ttf-font-awesome
ttf-hack
ttf-joypixels
ttf-liberation
typora
unclutter # remove mouse
unrar # RAR
unzip # ZIP
upower
urlscan
util-linux # provides SSD trimming
vdpauinfo # used to verify VDPAU
visual-studio-code-bin
vivid
w3m # used for lf preview
wavemon # wifi connection information
wget
which
whois
wireguard-tools
wireshark-qt
wol # wake on lan
xcape
xclip
xdg-utils
xdotool
xdo # Use with window swallowing
xorg-xbacklight
xorg-xev
xorg-xfontsel
xorg-xinput
xorg-xprop
xorg-xsetroot
xournal
xwallpaper
yarn
youtube-dl
zathura
zathura-pdf-poppler
zip
zmap
zoom
