adwaita-qt5 # theme
adwaita-qt6 # theme
alacritty # terminal
alsa-utils # alsamixer and more
android-apktool
android-file-transfer
android-tools
anki-bin # anki
arandr # manage displays
bash-completion # completion for bash
bat # better cat
bc # Used by displayselect
bemenu # dmenu clone, optionally required by xdg-desktop-portal-wlr
bibata-cursor-theme # cursor theme
bind # nslookup and more
bluez # bluetooth support
brave-bin # browser
bubblewrap # used by wrap script
cantarell-fonts # font
dash # faster POSIX shell
dbeaver
desktop-file-utils # Usually required by many things
desmume # Nintendo DS emulator
dmenu
dnscrypt-proxy # DoH
docker
docker-buildx # extended build capabilities with BuildKit
docker-compose
dosfstools # mkfs.fat
dragon-drop # drag and drop file
dunst # notification daemon
etcher-bin # work with ISOs
exfat-utils # mkfs.exfat
expac # requried by paccy
fcitx5
fcitx5-configtool
fcitx5-mozc
fcitx5-qt
fd # find directories and files
ffmpeg
firefox
flameshot
fontpreview-git
fuzzel
fzf
git-delta
github-cli
gnome-keyring
gnome-system-monitor
gnu-netcat
go-tools # goimports, godoc, gopls, etc
go-yq
graphviz
helix
helm
htop
hyperfine
imv
inetutils
iptables-nft
iw
jdk-openjdk
jq # Json parser
k9s
kubectl
lazydocker-bin
lazygit
libnotify # library for sending desktop notifications
libva-utils # used to verify VA-API
libxft
linux-firmware # Required for hardware video acceleration for skylake or later generations
lua-language-server
lxappearance # Used to customize GTK theme
maim # sceenshot utility
man-db
man-pages
megasync-bin
microsoft-edge-stable-bin
mlocate # Locate
mpv
mtr # Network diagnostics
ncdu # better du (find what is taking up space)
neofetch
neovim
net-tools
nmap
noto-fonts
noto-fonts-cjk
noto-fonts-emoji # Google emojis
openssh
openssl-1.1
otf-cascadia-code
otf-font-awesome
otf-ipafont
overdue
p7zip # 7z extentions
pacman-contrib # checkupdates, pactree and stuff
pacutils
pamixer # Control audio
pavucontrol
perl-file-mimeinfo
picom
pipewire-alsa
pipewire-jack
pipewire-pulse
pkgfile # tool for searching files from packages
postgresql-libs
powertop
pyright
python
python-black
python-pip
qbittorrent
qt6ct
qt6-wayland
ripgrep
river
rust
rust-analyzer
shellcheck
shellharden
shfmt # shell format
simple-mtpfs
sof-firmware
stow
sxhkd # Universal keybindings
sxiv # image viewer
tcpdump
tmux
tokei
traceroute
tree
ttf-cascadia-code # programming font
ttf-dejavu
ttf-fira-code
ttf-font-awesome
ttf-inconsolata
ttf-joypixels
ttf-liberation
ttf-nerd-fonts-symbols-mono
typescript-language-server
unclutter # remove mouse
unrar # RAR
unzip # ZIP
upower
util-linux # provides SSD trimming
vdpauinfo # used to verify VDPAU
ventoy-bin
visual-studio-code-bin
vivid
vlc
wayland
wget
which
whois
wireshark-qt
wl-clipboard
x86_energy_perf_policy
xarchiver
xdg-desktop-portal-wlr # Something that might be good for pipewire apparently
xdg-utils
xdotool
xdo # Use with window swallowing
xf86-input-synaptics
xorg-xbacklight
xorg-xev
xorg-xfontsel
xorg-xinput
xorg-xprop
xorg-xsetroot
xwallpaper
yaml-language-server
yarn
yt-dlp
zathura
zathura-pdf-poppler
zip
