adapta-gtk-theme
alacritty
alsa-utils
android-apktool
android-file-transfer
android-tools
anki
arandr
arch-install-scripts
arp-scan
atool # unarchive tool
bash-completion
bash-language-server
bat # better cat
bc # Used by displayselect
bibata-cursor-theme
bind
bmon # Network tool
brave-bin
breeze-gtk
burpsuite
calc
cantarell-fonts
chafa # used for lf image preview
clang
dash
desktop-file-utils # Usually required by many things
discord
dmenu
dnscrypt-proxy
docker
docker-compose
dosfstools # mkfs.fat
dunst
etcher-bin
exfat-utils
expac # requried by paccy
exploitdb
fcitx-configtool
fcitx-mozc
fcitx-qt5
fd # find directories and files
ffmpeg
firefox
flameshot
fontpreview-git
fzf
gcolor3 # color picker
git-delta
gnome-keyring
gnu-netcat
go-tools # goimports, godoc, gopls, etc
graphviz
helix
helm
highlight # used for lf preview
hping
htop
hyperfine
imv
inetutils
intellij-idea-community-edition
inter-font
iotop
iptables-nft
iw
jdk8-openjdk
jdk-openjdk
jq # Json parser
k9s
kubectl
lazygit
lf
libnotify # library for sending desktop notifications
libva-utils # used to verify VA-API
libxft-bgra
linux-firmware # Required for hardware video acceleration for skylake or later generations
lua-language-server
lxappearance # Used to customize GTK theme
macchanger
maim # sceenshot utility
man-db
man-pages
masscan
mediainfo # used for lf preview
minikube
mkvtoolnix-cli
mlocate # Locate
mpv
mtr # Network diagnostics
ncdu # better du (find what is taking up space)
neofetch
neovim
net-tools
nload # Network tool
nmap
noto-fonts
noto-fonts-cjk
noto-fonts-emoji # Google emojis
ntfs-3g
obsidian-appimage
openssh
openssh-askpass
openvpn
otf-cascadia-code
otf-ipafont
overdue
p7zip # 7z extentions
pacman-contrib # checkupdates, pactree and stuff
pacutils
papirus-icon-theme
pavucontrol
pcmanfm-gtk3
perl-image-exiftool
picom
pkgfile # tool for searching files from packages
postgresql-libs
pyright
python
python-pip
qbittorrent
redshift # nightlight
ripgrep
rust-analyzer
rustup
shellcheck
shellharden
shfmt # shell format
simple-mtpfs
stow
sxhkd # Universal keybindings
sxiv # image viewer
tcpdump
tmux
tokei
traceroute
tree
ttf-cascadia-code # programming font
ttf-dejavu
ttf-fira-code
ttf-font-awesome
ttf-hack
ttf-joypixels
ttf-liberation
unclutter # remove mouse
unrar # RAR
unzip # ZIP
upower
upx
util-linux # provides SSD trimming
vdpauinfo # used to verify VDPAU
ventoy-bin
visual-studio-code-bin
w3m # used for lf preview
wavemon # wifi connection information
websocat
wget
which
whois
wireshark-qt
wol # wake on lan
x86_energy_perf_policy
xclip
xdg-utils
xdotool
xdo # Use with window swallowing
xorg-xbacklight
xorg-xev
xorg-xfontsel
xorg-xinput
xorg-xprop
xorg-xsetroot
xournal
xwallpaper
yaml-language-server
yt-dlp
zaproxy
zathura
zathura-pdf-poppler
zip
